DELETE FROM user_roles;
DELETE FROM meals;
DELETE FROM users;
ALTER SEQUENCE global_seq RESTART WITH 100000;

INSERT INTO users (name, email, password)
VALUES ('User', 'user@yandex.ru', 'password'),
       ('Admin', 'admin@gmail.com', 'admin');

INSERT INTO user_roles (role, user_id)
VALUES ('USER', 100000),
       ('ADMIN', 100001),
       ('USER', 100001);

INSERT INTO meals (user_id, calories, description, dateTime)
VALUES (100000, 500, 'Завтрак 1', '2020-01-30 10:00:00'),
       (100000, 1000, 'Обед 1', '2020-01-30 13:00:00'),
       (100000, 500, 'Ужин 1', '2020-01-30 20:00:00'),
       (100000, 100, 'Еда на граничное значение 1', '2020-01-31 00:00:00'),
       (100000, 1000, 'Завтрак 1', '2020-01-31 10:00:00'),
       (100000, 500, 'Обед 1', '2020-01-31 13:00:00'),
       (100000, 410, 'Ужин 1', '2020-01-31 20:00:00'),
       (100001, 500, 'Завтрак 2', '2020-01-30 10:00:00'),
       (100001, 1000, 'Обед 2', '2020-01-30 13:00:00'),
       (100001, 500, 'Ужин 2', '2020-01-30 20:00:00'),
       (100001, 100, 'Еда на граничное значение 2', '2020-01-31 00:00:00'),
       (100001, 1000, 'Завтрак 2', '2020-01-31 10:00:00'),
       (100001, 500, 'Обед 2', '2020-01-31 13:00:00'),
       (100001, 410, 'Ужин 2', '2020-01-31 20:00:00');